create view liuliangtu20140507_1
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 00:00:00' and 时间<'2014-05-07 01:00:00' and 速度>0


-------------------------------------------------
create view liuliangtu20140507_2
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 01:00:00' and 时间<'2014-05-07 02:00:00'and 速度>0
-------------------------------------------------
create view liuliangtu20140507_3
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 02:00:00' and 时间<'2014-05-07 03:00:00'and 速度>0
-------------------------------------------------
create view liuliangtu20140507_4
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 03:00:00' and 时间<'2014-05-07 04:00:00'and 速度>0
---------------------------------------------------
create view liuliangtu20140507_5
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589 
and 时间>'2014-05-07 04:00:00' and 时间<'2014-05-07 05:00:00'and 速度>0
--------------------------------------------------
create view liuliangtu20140507_6
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 05:00:00' and 时间<'2014-05-07 06:00:00'and 速度>0
----------------------------------------------------
create view liuliangtu20140507_7
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 06:00:00' and 时间<'2014-05-07 07:00:00'and 速度>0
----------------------------------------------------
create view liuliangtu20140507_8
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589 
and 时间>'2014-05-07 07:00:00' and 时间<'2014-05-07 08:00:00'and 速度>0
-----------------------------------------------------
create view liuliangtu20140507_9
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 08:00:00' and 时间<'2014-05-07 09:00:00'and 速度>0
----------------------------------------------------
create view liuliangtu20140507_10
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 09:00:00' and 时间<'2014-05-07 10:00:00'and 速度>0
-----------------------------------------------------
create view liuliangtu20140507_11
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 10:00:00' and 时间<'2014-05-07 11:00:00'and 速度>0
------------------------------------------------------
create view liuliangtu20140507_12
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 11:00:00' and 时间<'2014-05-07 12:00:00'and 速度>0
-------------------------------------------------------
create view liuliangtu20140507_13
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589 
and 时间>'2014-05-07 12:00:00' and 时间<'2014-05-07 13:00:00'and 速度>0
------------------------------------------------------
create view liuliangtu20140507_14
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 13:00:00' and 时间<'2014-05-07 14:00:00'and 速度>0
----------------------------------------------------------
create view liuliangtu20140507_15
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 14:00:00' and 时间<'2014-05-07 15:00:00'and 速度>0
----------------------------------------------------------
create view liuliangtu20140507_16
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589 
and 时间>'2014-05-07 15:00:00' and 时间<'2014-05-07 16:00:00'and 速度>0

----------------------------------------------------------
create view liuliangtu20140507_17
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 16:00:00' and 时间<'2014-05-07 17:00:00'and 速度>0
----------------------------------------------------------
create view liuliangtu20140507_18
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 17:00:00' and 时间<'2014-05-07 18:00:00'and 速度>0
----------------------------------------------------------
create view liuliangtu20140507_19
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589 
and 时间>'2014-05-07 18:00:00' and 时间<'2014-05-07 19:00:00'and 速度>0
----------------------------------------------------------
create view liuliangtu20140507_20
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 19:00:00' and 时间<'2014-05-07 20:00:00'and 速度>0
----------------------------------------------------------
create view liuliangtu20140507_21
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 20:00:00' and 时间<'2014-05-07 21:00:00'and 速度>0
----------------------------------------------------------
create view liuliangtu20140507_22
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589 
and 时间>'2014-05-07 21:00:00' and 时间<'2014-05-07 22:00:00'and 速度>0
----------------------------------------------------------
create view liuliangtu20140507_23
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589 
and 时间>'2014-05-07 22:00:00' and 时间<'2014-05-07 23:00:00'and 速度>0
----------------------------------------------------------
create view liuliangtu20140507_24
as 
select *  from taxi0507 
where 经度>114.261 and 经度<114.289
and 维度>30.561 and 维度<30.589
and 时间>'2014-05-07 23:00:00' and 时间<'2014-05-07 23:59:59'and 速度>0
--------------------------------------------------------------

DECLARE @time DATETIME = GETDATE()
DECLARE @ms INT

select count(*) from liuliangtu20140507_1

SET @ms=DATEDIFF(ms,@time,GETDATE())
SELECT @ms --毫秒数

drop view liuliangtu20140507_1